PiChampion/PowerLineDataAquisitionDevice/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB2 (number 55), J4[2]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC0_SE12_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC0_SE12_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_ADC0_SE12_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name ADC0_SE23 (number 27), J4[11]
  @{ */
/* @} */

/*! @name PORTC7 (number 79), J1[13]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CMP0_IN1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_CMP0_IN1_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_CMP0_IN1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB9 (number 57), J1[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_Yellow_LED_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_Yellow_LED_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_Yellow_LED_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_Yellow_LED_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_Yellow_LED_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTB10 (number 58), J4[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_Green_LED_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_Green_LED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_Green_LED_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_Green_LED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_Green_LED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTB23 (number 69), J1[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_Red_LED_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_Red_LED_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_Red_LED_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_Red_LED_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_Red_LED_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC0 (number 70), J1[11]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_Button_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_Button_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_Button_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_Button_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LED_Button_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTD0 (number 93), J2[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_Testing_Button_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_Testing_Button_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_Testing_Button_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_Testing_Button_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_Testing_Button_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC6 (number 78), U8[11]/SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*! @name PORTB21 (number 67), D12[3]/LEDRGB_BLUE
  @{ */

